{
    "1": [
        "I would’ve been stuck looking at this too lol. I love buildings like this!",
        "2023-04-07 21:29"
    ],
    "2": [
        "I've been maintaining a cloud-based email service for 25 years. I assure you there is no permanent solution, it's an ongoing arms race that everyone is exhausted fighting. Blocking individual email addresses, which are mostly faked anyway, is futile. These days it's all about trying to parse the content of the email to determine if it's spam. The only people making decent progress on this front are Google, because of the sheer number of people using the service, they can real-time crowd-source spam flagging and reduce it somewhat. That's what Microsoft's trying to get you to do with sending in spam reports, if enough people do that they can catch spam before it reaches you, but it's clear to me Microsoft has not put in the engineering necessary for that yet.\n\nThe ultimate solution is leaving email behind. As a species, we are wasting so many billions of hours wading through junk email, and it won't get better. I'm not sure what to replace it with, though. I don't think the solution has been invented yet.",
        "2023-04-07 21:29"
    ],
    "3": [
        "Hehe, glad it would!",
        "2023-04-07 21:29"
    ],
    "4": [
        "Your submission has been automatically removed because your title does not follow the proper format. For more information, please refer to the sidebar or read [this post]( https://www.reddit.com/r/ClashOfClansRecruit/comments/5ummou/mod_rclashofclansrecruit_featured_on_official/).  If you make another post with a correctly formatted title, you will need to reach out to the moderators via modmail in order to override rule no. 3 in the sidebar as /u/patience_bot is a zealous mod and may delete your corrected post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ClashOfClansRecruit) if you have any questions or concerns.*",
        "2023-04-07 21:29"
    ],
    "5": [
        "Using the skull mask instead of facepaint is both very smart and very Griddle.",
        "2023-04-07 21:29"
    ],
    "6": [
        "Yeah BOI",
        "2023-04-07 21:29"
    ],
    "7": [
        "2.6",
        "2023-04-07 21:29"
    ],
    "8": [
        "Lmao",
        "2023-04-07 21:29"
    ],
    "9": [
        "Still have to screen ‘The Tenant’ :)",
        "2023-04-07 21:29"
    ],
    "10": [
        "No it's not lol. They say what you're saying as a matter of fact.",
        "2023-04-07 21:29"
    ]
}